<details ><summary>plan for ruby-getting-started-terraform 2025-12-30 08:53:26 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_route_table.bastion[0] will be created
  + resource "aws_route_table" "bastion" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-rt-1"
          + "Project"     = "ruby-getting-started"
          + "Type"        = "Private-Bastion"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-rt-1"
          + "Project"     = "ruby-getting-started"
          + "Type"        = "Private-Bastion"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.rds[0] will be created
  + resource "aws_route_table" "rds" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-rt-1"
          + "Project"     = "ruby-getting-started"
          + "Type"        = "Private-RDS"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-rt-1"
          + "Project"     = "ruby-getting-started"
          + "Type"        = "Private-RDS"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.bastion[0] will be created
  + resource "aws_route_table_association" "bastion" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rds[0] will be created
  + resource "aws_route_table_association" "rds" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.rds_backup will be created
  + resource "aws_s3_bucket" "rds_backup" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ruby-getting-started-rds-backup"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started RDS Backup Bucket"
          + "Project"     = "ruby-getting-started"
          + "Purpose"     = "RDS Database Backups"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started RDS Backup Bucket"
          + "Project"     = "ruby-getting-started"
          + "Purpose"     = "RDS Database Backups"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.rds_backup will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "rds_backup" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "delete-old-backups"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_policy.rds_backup will be created
  + resource "aws_s3_bucket_policy" "rds_backup" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.rds_backup will be created
  + resource "aws_s3_bucket_public_access_block" "rds_backup" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.rds_backup will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "rds_backup" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.rds_backup will be created
  + resource "aws_s3_bucket_versioning" "rds_backup" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_subnet.bastion[0] will be created
  + resource "aws_subnet" "bastion" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-subnet-1"
          + "Project"     = "ruby-getting-started"
          + "Type"        = "Private-Bastion"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-bastion-subnet-1"
          + "Project"     = "ruby-getting-started"
          + "Type"        = "Private-Bastion"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.rds[0] will be created
  + resource "aws_subnet" "rds" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-subnet-1"
          + "Project"     = "ruby-getting-started"
          + "Type"        = "Private-RDS"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-subnet-1"
          + "Project"     = "ruby-getting-started"
          + "Type"        = "Private-RDS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-vpc"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-vpc"
          + "Project"     = "ruby-getting-started"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (ruby-getting-started-terraform)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                            RESOURCE                             |
|--------|-----------------------------------------------------------------|
| add    | `aws_route_table.bastion[0]`                                    |
|        | `aws_route_table.rds[0]`                                        |
|        | `aws_route_table_association.bastion[0]`                        |
|        | `aws_route_table_association.rds[0]`                            |
|        | `aws_s3_bucket.rds_backup`                                      |
|        | `aws_s3_bucket_lifecycle_configuration.rds_backup`              |
|        | `aws_s3_bucket_policy.rds_backup`                               |
|        | `aws_s3_bucket_public_access_block.rds_backup`                  |
|        | `aws_s3_bucket_server_side_encryption_configuration.rds_backup` |
|        | `aws_s3_bucket_versioning.rds_backup`                           |
|        | `aws_subnet.bastion[0]`                                         |
|        | `aws_subnet.rds[0]`                                             |
|        | `aws_vpc.main`                                                  |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p ruby-getting-started-terraform
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>